{
    "title": "VentaEnterprise",
    "about": [
        "VentaEnterprise is a desktop application developed in Python that facilitates comprehensive sales and inventory management for businesses. With an intuitive and modern interface, it allows managing products, processing sales, generating invoices, and obtaining detailed reports efficiently.",
        "The system includes advanced functionalities such as real-time stock control, integration with exchange rates, product catalog management, and a complete reporting module that helps entrepreneurs make informed decisions based on accurate data.",
        "Developed with modern technologies like Python and Flet for the graphical interface, VentaEnterprise offers a smooth user experience with dark/light mode, intuitive navigation, and responsive design that adapts to different screen sizes.",
        "Ideal for stores, businesses, and small companies looking to digitize their sales and inventory management processes, eliminating paper use and reducing human errors in transaction recording."
    ],
    "features": [
        {
            "icon": "fas fa-shopping-cart",
            "text": "Sales Management"
        },
        {
            "icon": "fas fa-boxes",
            "text": "Inventory Control"
        },
        {
            "icon": "fas fa-chart-bar",
            "text": "Reports and Statistics"
        },
        {
            "icon": "fas fa-file-invoice-dollar",
            "text": "Automatic Invoicing"
        },
        {
            "icon": "fas fa-exchange-alt",
            "text": "Exchange Rates"
        },
        {
            "icon": "fas fa-search",
            "text": "Advanced Search"
        }
    ],
    "tech": [
        {
            "icon": "fab fa-python",
            "title": "Python",
            "desc": "Main programming language used for backend development and business logic."
        },
        {
            "icon": "fa-regular fa-object-group",
            "title": "Flet",
            "desc": "Modern framework for creating desktop applications with web-like interface using Python."
        },
        {
            "icon": "fas fa-database",
            "title": "SQLite",
            "desc": "Lightweight and efficient database for storing all system information."
        },
        {
            "icon": "fas fa-globe",
            "title": "Requests",
            "desc": "Library for consuming external APIs and obtaining real-time exchange rates."
        }
    ],
    "screenshots": [
        {
            "src": "assets/img/ventasentreprise/dashboard.webp",
            "alt": "Main Dashboard",
            "title": "Main Dashboard",
            "desc": "System overview with statistics and intuitive navigation."
        },
        {
            "src": "assets/img/ventasentreprise/productos.webp",
            "alt": "Product Management",
            "title": "Product Management",
            "desc": "Interface to add, edit, and delete products from inventory."
        },
        {
            "src": "assets/img/ventasentreprise/ventas.webp",
            "alt": "Sales Module",
            "title": "Sales Module",
            "desc": "Efficient sales processing with integrated shopping cart."
        },
        {
            "src": "assets/img/ventasentreprise/reportes.webp",
            "alt": "Reports and Analytics",
            "title": "Reports and Analytics",
            "desc": "Detailed analysis of sales, best-selling products, and trends."
        }
    ]
}